tutorials/lagrangian/reactingHeterogenousParcelFoam/rectangularDuct/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         reactingMixture;
    transport       sutherland;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

chemistryReader foamChemistryReader;

foamChemistryFile "<constant>/foam.inp";

foamChemistryThermoFile "<constant>/foam.dat";

inertSpecie   N2;

liquids
{}

solids
{
    Fe3O4
    {
        defaultCoeffs   no;
        Fe3O4Coeffs
        {
            rho             5100;
            Cp              850;
            kappa           0.04;
            Hf              0;
            emissivity      1.0;
            W               232;
        }
    }

    Fe2O3
    {
        defaultCoeffs   no;
        Fe2O3Coeffs
        {
            rho             5100;
            Cp              710;
            kappa           0.04;
            Hf              525e3; //Heat of reaction HfProd - HfFuel
            emissivity      1.0;
            W               159;   //Kg/Kmole
        }
    }
}


// ************************************************************************* //
